# IFCCategory Template Import From File Method

Source: https://www.revitapidocs.com/2026/c8618241-dc08-7698-05e8-b5c4d5514255.htm

---

| IFCCategory Template Import From File Method |
| --- |

Import mapping template from a text file.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static IFCCategoryTemplate ImportFromFile(
	Document document,
	string fileName,
	string templateName
)
```

```
Public Shared Function ImportFromFile (
	document As Document,
	fileName As String,
	templateName As String
) As IFCCategoryTemplate
```

```
public:
static IFCCategoryTemplate^ ImportFromFile(
	Document^ document,
	String^ fileName,
	String^ templateName
)
```

```
static member ImportFromFile :
        document : Document *
        fileName : string *
        templateName : string -> IFCCategoryTemplate
```

#### Parameters

document Document
:   A Revit document.

fileName String
:   A full text file name.

templateName String
:   A mapping template name.

#### Return Value

IFCCategoryTemplate
The mapping template element. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | The name already exists. |
| ArgumentNullException | A non\-optional argument was null |
| FileAccessException | Failed to access the text file. |
| InvalidOperationException | Failed to create IFCCategoryTemplate element. |

Remarks The imported template is saved in the document passed as parameter.
 The active template of the document remains unchanged. See Also

#### Reference

IFCCategoryTemplate Class Autodesk.Revit.DB Namespace